var jobArray=[
    {
      "jobname": "工程管理",
      "gwyq": "工程管理≠搬砖！你这里，你将以专业技术与方寸匠心，为工程项目的质量、进度和目标保驾护航。你可以在总部学习沉淀，推动管理标准化的提升；也可以深入一线，切身了解工程项目管理全流程。    ",
      "address": "长沙、武汉、南京、天津、厦门、成都、西安、合肥、福州、南昌、广州",
      "linkurl": ""
    },
    {
        "jobname": "客户关系",
        "gwyq":"客户关系≠客服！在这里，你将以细心勇气预判客户风险，直面客户事件；以敏锐分析洞察客户需求，转化产品实现；以专业工具监测客户服务，构建服务体系；以真诚匠心经营客户关系，营造客户体验；以暖心行动塑造服务品牌，践行客户导向。客户的全周期体验，都将因你的陪伴而更加美好。",
        "address": "苏州、武汉、南京、厦门、成都、合肥、南昌",
        "linkurl": ""
    },
    {
        "jobname": "人力资源",
        "gwyq":"人力资源≠招人！在这里，你将接触到员工关系、招聘配置、培训发展、绩效管理、薪酬福利等各大模块，在不断的沟通学习实践中获得赋能人才、变革组织、建设文化的能量，与正荣最宝贵的资源——人产生联结。",
        "address": "苏州、长沙、武汉、南京、天津、成都、合肥、福州、南昌、广州",
        "linkurl": ""
    },
    {
        "jobname": "综合管理",
        "gwyq":"综合管理≠后勤！在这里，你将是管理参谋，负责事项督办、会议管理、档案文控管理；你将是形象设计师，负责企业品牌策划、风控传播与文化建设；你将是贴心管家，以优质高效的行政保障、丰富多彩的员工关怀活动践行与传播幸福文化。",
        "address": "长沙、武汉、南京、天津、合肥、南昌",
        "linkurl": ""
    },
    // {
    //     "jobname": "法律事务",
    //     "gwyq":"",
    //     "address": "苏州、武汉、南京、天津、合肥、南昌",
    //     "linkurl": ""
    // },
    {
        "jobname": "成本管理",
        "gwyq":"成本管理≠省钱！在这里，你将协助开展项目全流程的成本控制和合同管理，负责预结算、数据库维护、成本后评估；通过建立完善的招采体系，选定质量好、价格优的供应商，打造高效高质的工程供应链。",
        "address": "苏州、长沙、南京、天津、厦门、西安、合肥、南昌",
        "linkurl": ""
    },
    {
        "jobname": "设计管理",
        "gwyq":"设计管理≠画图！在这里，你既要懂专业，又要有情怀，更要懂管理。你将以敏锐的洞察力和出色的专业理解挖掘产品价值，将设计意图准确传达给设计方，并协助它由图纸变成现实。你的努力将贯穿项目开发的全过程，包括但不限于产品策划与研发、样板区品控、大区建筑/景观/精装、成本、风险及计划管理、资源整合等。你的匠心，终将成就大师之名。",
        "address": "苏州、长沙、南京、天津、厦门、成都、西安、合肥、福州、南昌",
        "linkurl": ""
    },
    {
        "jobname": "财务资金",
        "gwyq":"财务资金≠算账！在这里，你将接触预算、核算、资金、税务、内控、资本等多模块的财务工作，在风云变幻的金融市场大展拳脚，与金融机构、外部投资人、政府机关谈笑风生，为企业防风险、降成本、增效益。作为公司业务部门的最强关联部门，选择财务资金的你，既可见细节，亦可览全局。",
        "address": "苏州、长沙、武汉、南京、天津、厦门、成都、西安、合肥、南昌、广州",
        "linkurl": ""
    },
    {
        "jobname": "投资管理",
        "gwyq":"投资管理≠花钱！在这里，你将协助进行项目拓展、城市发展趋势及投资机会分析，收集土地信息，编制可研报告并参与招拍挂、收并购、合作项目等谈判与获取。凭借你的专业、分析和洞察，帮助企业在风险可控的前提下，以最少的自有资金，在最短时间内赚到最多的钱。",
        "address": "苏州、武汉、南京、天津、厦门、成都、西安、合肥、福州、南昌、广州",
        "linkurl": ""
    },
    {
        "jobname": "运营管理",
        "gwyq":"运营管理≠做表！在这里，你将协助开展运营策略、经营目标与经营计划的制定与执行；围绕项目计划、重大事项、运营会议等，提升项目开发效率；对公司业务制度、流程管理体系的建立、运行、维护和优化负责。你将成为企业的决策参谋、业务纽带和区域桥梁。",
        "address": "苏州、南京、天津、厦门、成都、西安、合肥、福州、南昌",
        "linkurl": ""
    },
    {
        "jobname": "营销管理",
        "gwyq":"营销管理≠卖房子！在这里，你将接触策划、销售、客研、内控等营销全流程相关工作，基于项目分析，为项目营销推广制定多种策略方案，维护整合多方资源，全力执行落地，实现销售业绩与品牌影响力的提升。在达成公司经营目标的同时，为客户提供更好的产品与服务。",
        "address": "苏州、长沙、天津、厦门、西安、合肥、南昌、广州",
        "linkurl": ""
    }
    
  ]
                               
         var con="";
      for(var i=0;i<jobArray.length;i++) {
        con+=' <li><span>' + jobArray[i].jobname + '</span><span>' + jobArray[i].address + '</span><span><i></i></span></li>';
        con+='<div class="job_del">';
        con+=' <p>' + jobArray[i].gwyq + '</p>';     
        con+='</div>';
        con+='';
          con +='</div>';
          $(".job-list ul").html(con);
      } 
  
       
    $('div.job-list>ul>li').click(function () {
        var _hasClass = $(this).hasClass('on');
        if (_hasClass) {
            $(this).removeClass('on');
            $(this).next('div.job_del').hide();
        } else {
            $(this).addClass('on');
            $(this).siblings('li').removeClass('on');
            $(this).next('div.job_del').show();
            $(this).next('div.job_del').siblings('div.job_del').hide();
        }
    });